{
  "backend/main.mo": "Defines comprehensive backend actor types for media content, users, ads, referrals, wallets, approvals, and storage mixins.",
  "feature_evidence.json": "Lists implemented feature evidence entries linking features to files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Provides short functional summaries for numerous frontend files used throughout the app.",
  "frontend/index.css": "Tailwind base theme variables and global styles for light/dark mode and layout defaults.",
  "frontend/index.html": "HTML entry point defining root mount element and loading the main React script.",
  "frontend/src/App.tsx": "Configures TanStack Router with all public and admin routes, including guarded admin pages.",
  "frontend/src/components/AdBanner.tsx": "Renders a clickable banner ad that tracks views and clicks using query hooks.",
  "frontend/src/components/AdminAccessDenied.tsx": "Shows a styled access-denied screen with navigation back to home.",
  "frontend/src/components/AdminRouteGuard.tsx": "Protects admin routes by checking identity and admin status, showing loading or denial states as needed.",
  "frontend/src/components/AdSidebar.tsx": "Displays up to three sidebar ads with automatic view tracking and click handling.",
  "frontend/src/components/CategorySection.tsx": "Renders a grid of clickable media categories that navigate to category-specific pages.",
  "frontend/src/components/ChatRoomComponent.tsx": "Implements a chat room with polling, file attachments, and message sending for a given room.",
  "frontend/src/components/ContentCard.tsx": "Displays a media item's thumbnail, metadata, and stats with click-to-open behavior.",
  "frontend/src/components/ContentGrid.tsx": "Shows all and popular content in tabbed grids and opens a player when an item is selected.",
  "frontend/src/components/ContentPlayer.tsx": "Modal player that handles video, audio, or image content with controls and rating UI.",
  "frontend/src/components/DisplayScreen.tsx": "Displays currently active content with playback and basic metadata, or a placeholder if none.",
  "frontend/src/components/Footer.tsx": "Footer with navigation links, platform info, social icons, and admin login via Internet Identity.",
  "frontend/src/components/Header.tsx": "Header component with navigation, search, auth handling, and admin menus for desktop and mobile.",
  "frontend/src/components/Hero.tsx": "Landing hero section with animated visuals, marketing text, and navigation buttons.",
  "frontend/src/components/HeroHelper.tsx": "Interactive assistant widget with chat, speech recognition, speech synthesis, and user memory handling.",
  "frontend/src/components/JitsiMeetIntegration.tsx": "Embeds Jitsi Meet for video conferences, managing room creation, events, and participant states.",
  "frontend/src/components/Layout.tsx": "App layout wrapper providing header, footer, background theming, and conditional HeroHelper display.",
  "frontend/src/components/ProfileSetup.tsx": "Modal dialog for initial profile setup with a simple name entry form.",
  "frontend/src/components/SharedPlaybackComponent.tsx": "UI for shared playback rooms with basic play/pause state and room creation prompts.",
  "frontend/src/components/VersionBadge.tsx": "Displays the application version inside a styled badge.",
  "frontend/src/components/VideoCallComponent.tsx": "A UI component rendering a mock video call interface with mute, video toggle, and end-call controls.",
  "frontend/src/components/WAN22Integration.tsx": "A form-driven UI for simulating WAN 2.2 AI content generation with tabs, inputs, and mock API responses.",
  "frontend/src/constants/adminNav.ts": "Defines admin navigation items, section ordering, and route mappings for the admin dashboard.",
  "frontend/src/constants/appVersion.ts": "Exports the application’s static version label 'Version 42'.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useActorCapabilities.ts": "Computes boolean capability flags from the current actor and exposes loading state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login, storage, and context management using Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines many React Query hooks for reading and mutating backend data, including admin checks and image library actions. Provides wrappers around actor methods with caching, invalidation, and toast notifications.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for theming, layout behavior, typography, and utility classes. Ensures responsive text, overflow handling, and visual effects like gradients and glows.",
  "frontend/src/main.tsx": "Bootstraps the React app, setting up React Query and the Internet Identity provider before rendering the main App. Imports global styles.",
  "frontend/src/pages/AdminAdsPage.tsx": "Provides an interface for creating, viewing, updating, deleting, and toggling ads. Uses React Query hooks to manage advertisement data and supports form inputs and basic analytics like CTR.",
  "frontend/src/pages/AdminAffiliatePage.tsx": "Allows admins to create and view affiliate commission tiers. Uses React Query to load tiers and submit new tier data.",
  "frontend/src/pages/AdminApprovalPage.tsx": "Displays all pending approval items including content, members, admins, card loads, price updates, payouts, and images. Provides approve/reject actions and visual status indicators using multiple query hooks.",
  "frontend/src/pages/AdminContentPage.tsx": "Provides a form to upload new multimedia content and a list for deleting existing items using query hooks.",
  "frontend/src/pages/AdminDisplayPage.tsx": "Manages theater display screen content, showing active content and allowing upload of new display media.",
  "frontend/src/pages/AdminEditingRoomPage.tsx": "Handles approval, rejection, searching, and deletion of pending content submissions and related entities.",
  "frontend/src/pages/AdminHiiYahChatPage.tsx": "Administers broadcast and hero join requests with approve/reject actions and tabbed viewing.",
  "frontend/src/pages/AdminImageLibraryPage.tsx": "Supports uploading, approving, rejecting, downloading, and bulk-erasing images with progress tracking.",
  "frontend/src/pages/AdminInviteAcceptPage.tsx": "Handles accepting admin invite tokens, triggering login if needed and redeeming the invite via the actor before redirecting to the admin approvals page.",
  "frontend/src/pages/AdminInviteLinksPage.tsx": "Displays, generates, and copies admin invite codes using actor API calls and react-query for list refreshes.",
  "frontend/src/pages/AdminMallPage.tsx": "Implements a local CRUD interface for managing mall items, including create, update, delete, and basic inventory stats.",
  "frontend/src/pages/AdminMediaUploadRoomPage.tsx": "Provides an admin-only interface to upload media content with progress tracking and shows existing media grouped by type.",
  "frontend/src/pages/AdminMemberDirectoryPage.tsx": "Fetches all user profiles via the actor and provides search and role filtering in a member directory view.",
  "frontend/src/pages/AdminPriceControlRoomPage.tsx": "Admin interface for managing subscription, content, and mall-related pricing with tabbed categories and simulated save actions.",
  "frontend/src/pages/AdminPricingTermsPage.tsx": "Admin page for editing platform terms and subscription pricing, including loading active terms and saving updates via API.",
  "frontend/src/pages/AdminRoomsPage.tsx": "Lists navigable admin sections as cards, excluding the current page, allowing admins to access different management tools.",
  "frontend/src/pages/AdminWalletManagementPage.tsx": "Dashboard for viewing, searching, and managing BTC wallet seeds and mock blockchain analytics with visibility and copy controls.",
  "frontend/src/pages/AffiliateDashboardPage.tsx": "Affiliate dashboard showing referral stats, tiers, and link generation with copy and share functionality.",
  "frontend/src/pages/CategoryPage.tsx": "Displays content for a selected category with loading states and allows opening items in a content player.",
  "frontend/src/pages/CreditCardPage.tsx": "Displays a mock Excalibur credit card with identity check and placeholder balance-loading logic.",
  "frontend/src/pages/ExcaliburStudiosPage.tsx": "Provides a creative workspace interface with Jitsi Meet, WAN 2.2 integrations, and project tabs.",
  "frontend/src/pages/FlixiodTestPage.tsx": "Embeds and tests Flixiod streaming via iframe with navigation and informational sections.",
  "frontend/src/pages/HiiYahChatPage.tsx": "Implements a Rocket.Chat–based chat interface with tabs and placeholder connection features gated by login.",
  "frontend/src/pages/HomePage.tsx": "Home landing page featuring hero section, global streaming intro, and navigation to entertainment and financial services.",
  "frontend/src/pages/IHeartRadioTestPage.tsx": "Provides a test page with an embedded iHeartRadio iframe player and links for streaming music and radio.",
  "frontend/src/pages/MallPage.tsx": "Displays Clear Magic Mall branding, a search bar, and a coming-soon notice for future shopping features.",
  "frontend/src/pages/SignUpPage.tsx": "Implements a user registration form with validation and a submission confirmation screen.",
  "frontend/src/pages/StreamingPartnersPage.tsx": "Lists streaming platforms with navigation to test pages or external links for various media services.",
  "frontend/src/pages/TermsPage.tsx": "Fetches and displays the active terms and conditions, handling loading and missing content states.",
  "frontend/src/pages/WalletPage.tsx": "Manages Bitcoin wallet creation, loading funds, and viewing wallet info using Counterparty node integration.",
  "frontend/src/types/backend-extended.ts": "Defines extended frontend TypeScript types mirroring expected backend structures for media, approvals, transactions, chats, and other domain models.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, store, persist, and clear URL and session-based parameters, including hash-routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, animations, container settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks project metadata, admin-room feature requirements, and pending requests for adding missing admin rooms."
}