{
  "backend/main.mo": "Defines the canister actor and a large set of public types for media, users, ads, wallets, referrals, approvals, and storage mixins.",
  "backend/migration.mo": "Provides a placeholder migration module with a run function that returns an empty upgraded actor.",
  "feature_evidence.json": "Contains feature evidence entries mapping features to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Lists prewritten summaries of various frontend files for documentation or build planning.",
  "frontend/index.css": "Defines global Tailwind CSS variables and styles for light and dark themes using custom color tokens.",
  "frontend/index.html": "Base HTML entry point setting metadata and loading the main React script.",
  "frontend/src/App.tsx": "Configures the TanStack Router, theme provider, layout, and all public and admin routes.",
  "frontend/src/components/AdBanner.tsx": "Renders a clickable banner ad, tracking views and clicks using query hooks.",
  "frontend/src/components/admin/AdminCapabilityNotice.tsx": "Renders an alert box showing availability, empty state, or error messages with corresponding icons.",
  "frontend/src/components/AdminAccessDenied.tsx": "Shows an access‑denied message with a styled card and a button returning users to the homepage.",
  "frontend/src/components/AdminRouteGuard.tsx": "Guards admin routes by showing a loading screen during admin checks and redirecting non‑authorized users to an access‑denied view.",
  "frontend/src/components/AdSidebar.tsx": "Displays up to three sidebar ads and tracks impressions and clicks for each.",
  "frontend/src/components/CategorySection.tsx": "Displays a grid of category cards and navigates to the selected category when clicked.",
  "frontend/src/components/ChatRoomComponent.tsx": "Implements a chat UI with message polling, file attachments, and sending messages to a chat room.",
  "frontend/src/components/ContentCard.tsx": "Renders a media preview card showing type, title, stats, and duration with hover actions.",
  "frontend/src/components/ContentGrid.tsx": "Loads all content, displays it in tabbed grids, and opens a player when an item is selected.",
  "frontend/src/components/ContentPlayer.tsx": "Shows a modal media player supporting video, audio, and rating interaction.",
  "frontend/src/components/DisplayScreen.tsx": "Displays the currently active content with video playback and metadata if available.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with navigation links, social icons, and login for admin access.",
  "frontend/src/components/Header.tsx": "Provides the main site header with navigation, search, authentication controls, and admin routing logic.",
  "frontend/src/components/Hero.tsx": "Displays the homepage hero section with animations, marketing text, and navigation buttons.",
  "frontend/src/components/HeroHelper.tsx": "Implements an interactive assistant widget with chat, voice input, speech synthesis, and persistent user memory.",
  "frontend/src/components/JitsiMeetIntegration.tsx": "Integrates Jitsi Meet for starting, managing, and interacting with video conferences.",
  "frontend/src/components/Layout.tsx": "Defines the global page layout with header, footer, route background logic, and conditional HeroHelper rendering.",
  "frontend/src/components/ProfileSetup.tsx": "Provides a modal for initial profile setup with a simple name form and simulated submission.",
  "frontend/src/components/SharedPlaybackComponent.tsx": "Shows a shared playback UI with placeholder content and play/pause state handling.",
  "frontend/src/components/VersionBadge.tsx": "Returns null to hide version information from the UI.",
  "frontend/src/components/VideoCallComponent.tsx": "A UI card showing a mock video call interface with mute, video toggle, and end-call actions.",
  "frontend/src/components/WAN22Integration.tsx": "A form-driven UI for simulating WAN 2.2 content generation, including project inputs and status handling.",
  "frontend/src/constants/adminNav.ts": "Defines admin navigation items, section order, and route mappings for the admin interface.",
  "frontend/src/constants/appVersion.ts": "Exports an empty application version constant.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing queries when the actor changes.",
  "frontend/src/hooks/useActorCapabilities.ts": "Derives boolean capability flags from the backend actor for admin feature access control.",
  "frontend/src/hooks/useAdminStatus.ts": "Checks whether the authenticated user is an admin and exposes admin UI eligibility.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, login/logout handling, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Provides many React Query hooks for fetching and mutating backend data, including user profiles, admin actions, approvals, ads, content, and more.",
  "frontend/src/index.css": "Defines global Tailwind CSS styles, color themes, typography, layout rules, and utility classes.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminAdsPage.tsx": "Admin UI for listing, creating, editing, deleting, and toggling ads, with capability checks and form handling.",
  "frontend/src/pages/AdminAffiliatePage.tsx": "Admin page to view and create affiliate tiers, including a dialog form and table listing.",
  "frontend/src/pages/AdminApprovalPage.tsx": "Aggregates and displays all pending approval items across multiple categories, allowing admins to approve or reject them.",
  "frontend/src/pages/AdminContentPage.tsx": "Admin interface to upload, list, and delete media content with form inputs and upload progress.",
  "frontend/src/pages/AdminDisplayPage.tsx": "Displays current screen content and provides a form to submit new display content.",
  "frontend/src/pages/AdminEditingRoomPage.tsx": "Provides admin tools to review, approve, reject, search, and delete various content, ads, and categories.",
  "frontend/src/pages/AdminHiiYahChatPage.tsx": "Lets admins review and approve or reject broadcast and hero join requests.",
  "frontend/src/pages/AdminImageLibraryPage.tsx": "Handles image upload, approval, rejection, and bulk deletion for the platform’s image library.",
  "frontend/src/pages/AdminInviteAcceptPage.tsx": "Processes admin invite tokens, manages II login flow, and redeems invitations before redirecting.",
  "frontend/src/pages/AdminInviteLinksPage.tsx": "Fetches, displays, and generates admin invite codes with copy-to-clipboard support using React Query.",
  "frontend/src/pages/AdminMallPage.tsx": "Provides CRUD management for mall items including creation, editing, deletion, and summary stats.",
  "frontend/src/pages/AdminMediaUploadRoomPage.tsx": "Allows admins to upload media content, track upload progress, and view categorized media items.",
  "frontend/src/pages/AdminMemberDirectoryPage.tsx": "Lists and filters user profiles for admins, with capability checks and search/filter controls.",
  "frontend/src/pages/AdminPriceControlRoomPage.tsx": "Admin interface for editing subscription, content, and mall-related pricing with save actions.",
  "frontend/src/pages/AdminPricingTermsPage.tsx": "Admin UI for editing pricing and terms, loading active terms, and saving updates with validation and alerts.",
  "frontend/src/pages/AdminRoomsPage.tsx": "Displays a grid of admin sections and navigates to selected admin routes using predefined nav items.",
  "frontend/src/pages/AdminWalletManagementPage.tsx": "Mock wallet monitoring dashboard showing BTC metrics, seed visibility toggling, and clipboard actions.",
  "frontend/src/pages/AffiliateDashboardPage.tsx": "Affiliate dashboard to generate, view, and copy referral links, and display tier and activity metrics.",
  "frontend/src/pages/CategoryPage.tsx": "Fetches and displays media content for a category, allowing users to open items in a content player.",
  "frontend/src/pages/CreditCardPage.tsx": "Displays a mock Excalibur credit card interface with balance input and login gating.",
  "frontend/src/pages/ExcaliburStudiosPage.tsx": "Provides a studio workspace UI with hero section, tabs, and integrations for Jitsi Meet and WAN 2.2 AI tools.",
  "frontend/src/pages/FlixiodTestPage.tsx": "Test page for Flixiod streaming with an embedded player, banner, and option to open the site in a new tab.",
  "frontend/src/pages/HiiYahChatPage.tsx": "Authenticated chat hub featuring Rocket.Chat‑based messaging, video calls, playback, and connection-code UI placeholders.",
  "frontend/src/pages/HomePage.tsx": "Main landing page with hero section, global streaming overview, featured content categories, and financial services showcase.",
  "frontend/src/pages/IHeartRadioTestPage.tsx": "Test page for iHeartRadio streaming with embedded player, banner, and external‑link launch.",
  "frontend/src/pages/MallPage.tsx": "Mall landing page with branding, search input, and a placeholder card indicating the shopping feature is coming soon.",
  "frontend/src/pages/SignUpPage.tsx": "Renders a signup form with validation and a simulated submission flow, showing a confirmation screen after success.",
  "frontend/src/pages/StreamingPartnersPage.tsx": "Displays a grid of streaming partner platforms with icons and buttons for testing or opening each service.",
  "frontend/src/pages/TermsPage.tsx": "Fetches and displays active terms and conditions with loading and fallback states.",
  "frontend/src/pages/WalletPage.tsx": "Manages wallet creation and viewing states, including authentication checks, loading, and display of wallet details.",
  "frontend/src/types/backend-extended.ts": "Provides extended TypeScript interfaces mirroring expected backend structures for media, users, wallets, and related entities.",
  "frontend/src/utils/adminNavScroll.ts": "Utility to navigate to an admin route and scroll to the top after navigation.",
  "frontend/src/utils/urlParams.ts": "Utilities for persisting, retrieving, and clearing invite tokens and other secret URL parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, content paths, extended theme colors, shadows, animations, and plugins including typography, container queries, and animations.",
  "project_state.json": "Stores the project’s build state, tracking admin-focused feature fixes, known issues, and pending requests for login, approvals, editing, uploads, responsiveness, and theming."
}