{
  "backend/main.mo": "Defines the primary actor with extensive type definitions for media, users, ads, referrals, wallets, and pending approval workflows, integrating storage and authorization mixins.",
  "backend/migration.mo": "Provides a no-op migration module that returns the previous actor state unchanged.",
  "feature_evidence.json": "Contains feature evidence metadata mapping features to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Lists high-level summaries of various frontend files for reference or documentation.",
  "frontend/index.css": "Defines Tailwind CSS base variables, dark mode overrides, and global styling rules.",
  "frontend/index.html": "HTML entry point loading the React application and defining basic metadata.",
  "frontend/src/App.tsx": "Configures TanStack Router routes, including admin routes wrapped in AdminRouteGuard, and sets the app layout.",
  "frontend/src/components/AdBanner.tsx": "Displays a single active banner ad, tracking views and clicks via backend hooks.",
  "frontend/src/components/AdminAccessDenied.tsx": "Shows an access-denied screen for non-admin users with a button to return home.",
  "frontend/src/components/AdminRouteGuard.tsx": "Protects admin routes by checking admin status, handling loading states, and showing denial UI when unauthorized.",
  "frontend/src/components/AdSidebar.tsx": "Renders up to three active sidebar ads with automatic view tracking and click handling.",
  "frontend/src/components/CategorySection.tsx": "Displays a grid of predefined media categories as clickable cards that navigate to category-specific pages.",
  "frontend/src/components/ChatRoomComponent.tsx": "Implements a chat room UI with message polling, text/file message sending, and auto-scrolling.",
  "frontend/src/components/ContentCard.tsx": "Renders a media content preview card showing type, title, stats, and an interactive hover play overlay.",
  "frontend/src/components/ContentGrid.tsx": "Shows all and popular media content in tabbed grids and opens a player when an item is selected.",
  "frontend/src/components/ContentPlayer.tsx": "Provides a modal player for video, audio, or images with playback controls, rating, and metadata.",
  "frontend/src/components/DisplayScreen.tsx": "Displays the currently active content with auto-playing video and metadata for a display screen view.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with navigation links, social icons, and admin login integration.",
  "frontend/src/components/Header.tsx": "Header with navigation, search, authentication, and admin menu logic responsive for desktop and mobile.",
  "frontend/src/components/Hero.tsx": "Landing hero section with animated visuals, headline text, and navigation buttons to streaming and wallet pages.",
  "frontend/src/components/HeroHelper.tsx": "Interactive assistant widget with chat, speech recognition, speech synthesis, and personalized memory storage.",
  "frontend/src/components/JitsiMeetIntegration.tsx": "Component that loads and manages a Jitsi Meet video conference with event handling and UI controls.",
  "frontend/src/components/Layout.tsx": "App layout wrapper providing header, footer, background styling, route outlet, and conditional HeroHelper display.",
  "frontend/src/components/ProfileSetup.tsx": "Simple modal form allowing users to enter and save their name during profile setup.",
  "frontend/src/components/SharedPlaybackComponent.tsx": "UI card for shared playback rooms with placeholder media, playback toggles, and room creation button.",
  "frontend/src/components/VersionBadge.tsx": "Renders nothing to hide version info from the UI.",
  "frontend/src/components/VideoCallComponent.tsx": "Provides a video call UI with mute, video toggle, and end-call actions using state and toast notifications.",
  "frontend/src/components/WAN22Integration.tsx": "Implements a WAN 2.2 content creation interface with form inputs, simulated API generation, and project handling.",
  "frontend/src/constants/adminNav.ts": "Defines admin navigation sections, ordered menu items, and route mappings for the admin dashboard.",
  "frontend/src/constants/appVersion.ts": "Exports an empty application version constant.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes related queries on identity change.",
  "frontend/src/hooks/useActorCapabilities.ts": "Derives actor capability flags based on the loaded actor and exposes loading state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, stored identity loading, and status management.",
  "frontend/src/hooks/useQueries.ts": "Provides numerous React Query hooks for interacting with backend actor methods, including admin checks, image library operations, and various pending approval workflows.",
  "frontend/src/index.css": "Defines global TailwindCSS styles, theme variables, responsive typography, overflow handling, and utility classes for consistent UI layout.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with Internet Identity and React Query providers before rendering App.",
  "frontend/src/pages/AdminAdsPage.tsx": "Implements an admin UI for creating, listing, editing, deleting, and toggling advertisements with form handling and CTR calculation.",
  "frontend/src/pages/AdminAffiliatePage.tsx": "Provides an interface to create affiliate tiers and display existing tiers using React Query and form inputs.",
  "frontend/src/pages/AdminApprovalPage.tsx": "Aggregates multiple approval queues (content, members, admins, card loads, prices, payouts, images) and provides actions to approve or reject pending items.",
  "frontend/src/pages/AdminContentPage.tsx": "Provides a form to upload new multimedia content and a list to delete existing items, using query hooks for create and delete operations.",
  "frontend/src/pages/AdminDisplayPage.tsx": "Manages theater display screen content by showing the currently active item and offering a form to upload new display content.",
  "frontend/src/pages/AdminEditingRoomPage.tsx": "Displays pending content submissions with search, allowing admins to approve, reject, or delete various content types.",
  "frontend/src/pages/AdminHiiYahChatPage.tsx": "Handles approval and rejection of broadcast and hero join requests with tabbed views for different request categories.",
  "frontend/src/pages/AdminImageLibraryPage.tsx": "Manages image uploads, approvals, rejections, downloads, and viewing of pending and approved images with upload progress tracking.",
  "frontend/src/pages/AdminInviteAcceptPage.tsx": "Handles accepting admin invitation tokens, triggering login if needed and redeeming the invite via actor API, with status feedback and automatic navigation on success.",
  "frontend/src/pages/AdminInviteLinksPage.tsx": "Displays, generates, and copies admin invite codes using actor API, separating available and used codes with UI actions.",
  "frontend/src/pages/AdminMallPage.tsx": "Provides a local CRUD interface for managing mall items, including creating, editing, deleting, and listing inventory with totals.",
  "frontend/src/pages/AdminMediaUploadRoomPage.tsx": "Allows admins to upload media content with progress tracking and lists existing content filtered by media type.",
  "frontend/src/pages/AdminMemberDirectoryPage.tsx": "Fetches all user profiles and provides search and role-based filtering in a tabular member directory.",
  "frontend/src/pages/AdminPriceControlRoomPage.tsx": "Admin page for managing subscription, content, and mall pricing with tabs and save actions.",
  "frontend/src/pages/AdminPricingTermsPage.tsx": "Admin interface to edit terms and conditions and manage subscription pricing with version loading and save support.",
  "frontend/src/pages/AdminRoomsPage.tsx": "Lists all admin sections as navigable cards excluding the current page.",
  "frontend/src/pages/AdminWalletManagementPage.tsx": "Dashboard showing wallet seeds, search, visibility toggling, and mock BTC balance monitoring.",
  "frontend/src/pages/AffiliateDashboardPage.tsx": "Affiliate dashboard for generating referral links, viewing stats, and determining current tier.",
  "frontend/src/pages/CategoryPage.tsx": "Displays content for a given category and allows selecting and playing specific items.",
  "frontend/src/pages/CreditCardPage.tsx": "UI for a mock Excalibur credit card, showing card visuals and a placeholder balance loading feature requiring login.",
  "frontend/src/pages/ExcaliburStudiosPage.tsx": "Creative workspace page with hero section, tabs, and integrations for Jitsi Meet and WAN 2.2.",
  "frontend/src/pages/FlixiodTestPage.tsx": "Test page for Flixiod streaming featuring an embedded player, navigation controls, and integration info.",
  "frontend/src/pages/HiiYahChatPage.tsx": "Rocket.Chat‑powered messaging hub with authentication checks, connection code placeholders, and tabs for chat, calls, and shared playback.",
  "frontend/src/pages/HomePage.tsx": "Landing page showcasing featured content sections, global streaming intro, and financial service highlights with navigation links.",
  "frontend/src/pages/IHeartRadioTestPage.tsx": "Provides an iHeartRadio test page with an embedded streaming iframe and navigation back to the streaming partners list.",
  "frontend/src/pages/MallPage.tsx": "Displays the Clear Magic Mall page with branding, search input, and a coming-soon notice.",
  "frontend/src/pages/SignUpPage.tsx": "Implements a user registration form with validation and a submitted state confirmation screen.",
  "frontend/src/pages/StreamingPartnersPage.tsx": "Lists streaming partner platforms with navigation to test pages or external links.",
  "frontend/src/pages/TermsPage.tsx": "Fetches and displays active terms and conditions with loading and fallback states.",
  "frontend/src/pages/WalletPage.tsx": "Manages the Excalibur Wallet UI including wallet creation, loading funds, and viewing wallet info.",
  "frontend/src/types/backend-extended.ts": "Defines TypeScript types mirroring expected backend data structures for media, approvals, admin requests, transactions, and chat models.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and managing hash-based query data.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, animations, container settings, and plugins for typography, animations, and container queries.",
  "project_state.json": "Describes project state, outstanding issues, and feature requests related to admin flow, version label removal, and admin detection."
}