{
  "backend/main.mo": "Defines actor with storage mixins and extensive type models for media, users, ads, wallets, approvals, and affiliate systems.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of various frontend files across the app.",
  "frontend/index.css": "Global Tailwind CSS setup defining theme variables, dark mode overlays, and base styling rules.",
  "frontend/index.html": "HTML entry point containing the root mount and script to load the frontend application.",
  "frontend/src/App.tsx": "Main router configuration registering all public and admin routes using AdminRouteGuard and Layout.",
  "frontend/src/components/AdBanner.tsx": "Displays a single banner ad for a placement, tracking views and clicks via query hooks.",
  "frontend/src/components/admin/AdminCapabilityNotice.tsx": "Shows an alert with icon and title based on admin capability states such as unavailable, empty, or error.",
  "frontend/src/components/AdminAccessDenied.tsx": "Styled access-denied screen shown to non-admin users with navigation back to home.",
  "frontend/src/components/AdminRouteGuard.tsx": "Protects admin routes by checking authentication and admin status with loading and denial states.",
  "frontend/src/components/AdSidebar.tsx": "Renders up to three sidebar ads for a placement and tracks their views and clicks.",
  "frontend/src/components/CategorySection.tsx": "Renders a grid of genre category cards that navigate to category pages when clicked.",
  "frontend/src/components/ChatRoomComponent.tsx": "Implements a chat room with polling, file uploads, message sending, and auto-scrolling.",
  "frontend/src/components/ContentCard.tsx": "Displays a media item card with icon, metadata, and hover actions for selection.",
  "frontend/src/components/ContentGrid.tsx": "Shows tabs for all and popular content, renders content cards, and opens a player on selection.",
  "frontend/src/components/ContentPlayer.tsx": "Provides a modal media player supporting video, audio, basic controls, and user rating.",
  "frontend/src/components/DisplayScreen.tsx": "Displays currently active content with autoplay video and type badge or fallback text.",
  "frontend/src/components/Footer.tsx": "Renders site footer with navigation links, social icons, and admin login handling.",
  "frontend/src/components/Header.tsx": "Header component with navigation, search, authentication actions, and admin menu handling for desktop and mobile.",
  "frontend/src/components/Hero.tsx": "Hero section with animated visuals, marketing text, and buttons linking to streaming partners and wallet pages.",
  "frontend/src/components/HeroHelper.tsx": "Interactive assistant widget with chat, speech recognition, speech synthesis, user memory, and personalized greetings.",
  "frontend/src/components/JitsiMeetIntegration.tsx": "Embeds Jitsi Meet to host video conferences with room creation, participant tracking, and media controls.",
  "frontend/src/components/Layout.tsx": "Layout wrapper that applies route‑based backgrounds and renders header, footer, content outlet, and optional HeroHelper.",
  "frontend/src/components/ProfileSetup.tsx": "Simple modal form allowing users to enter and save their name during profile setup.",
  "frontend/src/components/SharedPlaybackComponent.tsx": "UI card for shared playback rooms, showing preview, viewer count, and controls to play or create a room.",
  "frontend/src/components/VersionBadge.tsx": "Empty component that hides version info by rendering nothing.",
  "frontend/src/components/VideoCallComponent.tsx": "Provides a video call UI with mute, video toggle, and end-call controls using a static preview image.",
  "frontend/src/components/WAN22Integration.tsx": "Implements a form-driven interface to simulate WAN 2.2 AI content generation with project creation, tabs, and mock API behavior.",
  "frontend/src/constants/adminNav.ts": "Defines admin navigation items, section ordering, and route mappings for the admin dashboard UI.",
  "frontend/src/constants/appVersion.ts": "Exports an empty application version constant.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useActorCapabilities.ts": "Maps backend actor methods to capability flags and returns them with loading state.",
  "frontend/src/hooks/useAdminStatus.ts": "Combines identity and admin checks to determine when admin UI should be displayed.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a context and hooks for managing Internet Identity login, state, and persistence using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, admin status, approvals, and related mutations using an actor API.",
  "frontend/src/index.css": "Sets global Tailwind styles, theme variables, layout rules, and utility classes for consistent UI behavior.",
  "frontend/src/main.tsx": "Bootstraps the app by creating the React root and wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminAdsPage.tsx": "Implements an admin UI for listing, creating, editing, deleting, and toggling ads with capability checks.",
  "frontend/src/pages/AdminAffiliatePage.tsx": "Provides an admin page to view and create affiliate tiers via dialogs and form inputs.",
  "frontend/src/pages/AdminApprovalPage.tsx": "Displays multiple approval queues and provides actions to approve or reject various pending items.",
  "frontend/src/pages/AdminContentPage.tsx": "Provides a form to upload new multimedia content and lists existing items with delete support using query hooks.",
  "frontend/src/pages/AdminDisplayPage.tsx": "Manages theater display content by showing the active item and providing a form to upload new display screen content.",
  "frontend/src/pages/AdminEditingRoomPage.tsx": "Displays pending content submissions with search, allowing admins to approve, reject, or delete various content types.",
  "frontend/src/pages/AdminHiiYahChatPage.tsx": "Administers chat-related requests, enabling approval or rejection of broadcast and hero join submissions.",
  "frontend/src/pages/AdminImageLibraryPage.tsx": "Offers image upload, approval, rejection, and mass-delete tools while listing pending and approved images.",
  "frontend/src/pages/AdminInviteAcceptPage.tsx": "Handles reading an invite token from the URL, prompting for Internet Identity login if needed, and redeeming the admin invite via the backend before redirecting to admin approvals.",
  "frontend/src/pages/AdminInviteLinksPage.tsx": "Allows admins to generate, view, and copy invitation codes by fetching invite codes from the backend and creating new ones.",
  "frontend/src/pages/AdminMallPage.tsx": "Provides a local-state mall management UI for creating, editing, and deleting mall items with modal dialogs and summary stats.",
  "frontend/src/pages/AdminMediaUploadRoomPage.tsx": "Provides an admin-only interface to upload media content with progress tracking and lists existing uploaded items.",
  "frontend/src/pages/AdminMemberDirectoryPage.tsx": "Fetches and displays all user profiles for admins with search and role filtering, handling missing backend capabilities gracefully.",
  "frontend/src/pages/AdminPriceControlRoomPage.tsx": "Admin interface for updating subscription, content, and mall-related prices with save actions and access control.",
  "frontend/src/pages/AdminPricingTermsPage.tsx": "Allows admins to view, edit, and publish pricing plans and terms, including loading active terms and creating new versions.",
  "frontend/src/pages/AdminRoomsPage.tsx": "Displays a grid of admin sections and links, letting admins navigate to different management areas.",
  "frontend/src/pages/AdminWalletManagementPage.tsx": "Provides mock BTC wallet monitoring and recovery UI with seed visibility toggles and balance history charts.",
  "frontend/src/pages/AffiliateDashboardPage.tsx": "Shows referral stats, tier information, and lets users generate and copy their affiliate referral link.",
  "frontend/src/pages/CategoryPage.tsx": "Fetches and displays media content by category, allowing users to open a selected item in a content player.",
  "frontend/src/pages/CreditCardPage.tsx": "Displays a mock Excalibur credit card with holographic visuals and allows users to enter an amount, though loading balance is not yet implemented.",
  "frontend/src/pages/ExcaliburStudiosPage.tsx": "Provides a creative workspace interface featuring Jitsi Meet and WAN 2.2 integrations with tabbed sections and project navigation.",
  "frontend/src/pages/FlixiodTestPage.tsx": "Offers a test page for Flixiod streaming with an embedded player and links to open the platform externally.",
  "frontend/src/pages/HiiYahChatPage.tsx": "Implements a Rocket.Chat‑powered chat interface with tabs for messaging, calls, and shared playback, with many features marked as coming soon.",
  "frontend/src/pages/HomePage.tsx": "Serves as the main landing page with hero content, featured categories, global streaming overview, and financial services highlights.",
  "frontend/src/pages/IHeartRadioTestPage.tsx": "Provides a test page with an embedded iHeartRadio player, navigation, and info cards for streaming integration.",
  "frontend/src/pages/MallPage.tsx": "Displays Clear Magic Mall branding with a search bar and a coming-soon notice for future shopping features.",
  "frontend/src/pages/SignUpPage.tsx": "Implements a sign-up form with validation, simulated submission, and a confirmation screen after registration.",
  "frontend/src/pages/StreamingPartnersPage.tsx": "Lists streaming platforms with navigation to test pages or external links, using cards and icons.",
  "frontend/src/pages/TermsPage.tsx": "Fetches and displays active terms and conditions, handling loading and missing-content states.",
  "frontend/src/pages/WalletPage.tsx": "Manages Bitcoin wallet creation, loading funds, and viewing wallet info with Counterparty node integration.",
  "frontend/src/types/backend-extended.ts": "Defines extended frontend-only TypeScript types mirroring expected backend structures for media, approvals, ads, affiliates, wallet, chat, and other entities.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading URL parameters, persisting them in sessionStorage, and cleaning them from URL hashes.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom colors, container settings, animations, keyframes, and plugins for typography, container queries, and animations.",
  "project_state.json": "Stores project metadata, known issues, and feature request tracking for the admin-area work."
}