{
  "backend/main.mo": "Defines the main actor and a large set of types for media content, users, ads, approvals, wallets, and affiliate systems, integrating multiple mixins and storage modules. No business logic is shown beyond type declarations.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, descriptions, related files, components, and test references with high-level metadata. Used for tracking feature completeness and validation.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of numerous frontend files describing their functionality, routing, UI components, and styling updates across the app.",
  "frontend/index.css": "Tailwind base/style variables defining theme colors, dark mode values, and global styling for backgrounds, text, borders, and layout.",
  "frontend/index.html": "HTML entry file setting up metadata and linking to the React application entry script.",
  "frontend/src/App.tsx": "Main React router configuration registering all user and admin routes, wrapping admin paths with AdminRouteGuard, and connecting pages to the layout.",
  "frontend/src/components/AdBanner.tsx": "Displays a single banner advertisement, tracks views and clicks, and opens the target URL when clicked.",
  "frontend/src/components/AdminAccessDenied.tsx": "Shows a styled access-denied screen with messaging and navigation back to the home page for non-admin users.",
  "frontend/src/components/AdminRouteGuard.tsx": "Guards routes by checking Internet Identity authentication and admin status, showing a loader or access denied screen when appropriate.",
  "frontend/src/components/AdSidebar.tsx": "Renders up to three sidebar ads, tracking impressions and clicks for each and linking out to target URLs.",
  "frontend/src/components/CategorySection.tsx": "Displays clickable media categories with icons and navigates to category-specific pages.",
  "frontend/src/components/ChatRoomComponent.tsx": "Renders a real-time chat room with polling, text and file message sending, and message display with metadata.",
  "frontend/src/components/ContentCard.tsx": "Shows a media item preview card with icon, stats, and hover play overlay for videos, audio, or images.",
  "frontend/src/components/ContentGrid.tsx": "Displays all and popular media content in tabbed grids and opens a content player on selection.",
  "frontend/src/components/ContentPlayer.tsx": "Provides a modal player for video, audio, or image content with playback controls, rating, and metadata display.",
  "frontend/src/components/DisplayScreen.tsx": "Shows currently active display content with auto‑play video and content type badge.",
  "frontend/src/components/Footer.tsx": "Renders site footer with navigation links, social icons, branding, and optional Internet Identity login.",
  "frontend/src/components/Header.tsx": "Renders the main site header with navigation, search, auth actions, and optional admin menus.",
  "frontend/src/components/Hero.tsx": "Displays the landing hero section with animated visuals and buttons to explore streaming or open the wallet.",
  "frontend/src/components/HeroHelper.tsx": "Implements an interactive assistant widget with chat, voice input, speech synthesis, and saved user memory.",
  "frontend/src/components/JitsiMeetIntegration.tsx": "Provides a Jitsi Meet video‑conference controller with room setup, event handling, and participant state tracking.",
  "frontend/src/components/Layout.tsx": "Defines the global page layout with header, footer, dynamic background, and the HeroHelper overlay.",
  "frontend/src/components/ProfileSetup.tsx": "Shows a modal for users to enter their name and complete initial profile setup.",
  "frontend/src/components/SharedPlaybackComponent.tsx": "Displays a shared playback UI with a preview area, play/pause toggle, and room creation option.",
  "frontend/src/components/VideoCallComponent.tsx": "Provides a UI-only video call interface with mute, video toggle, and end-call controls using local state and toast notifications.",
  "frontend/src/components/WAN22Integration.tsx": "Implements a form-driven UI for generating AI content via a simulated WAN 2.2 API, supporting content options, tabs, and preview/download placeholders.",
  "frontend/src/constants/adminNav.ts": "Defines the admin navigation structure with labeled routes, icons, sections, and a helper to group items by section.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, reinitializing and invalidating queries when identity changes.",
  "frontend/src/hooks/useActorCapabilities.ts": "Maps backend actor methods to boolean capability flags and exposes them with a loading state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context, hooks, and a provider for handling Internet Identity login, stored identities, and auth client behavior.",
  "frontend/src/hooks/useQueries.ts": "Defines a large set of React Query hooks for admin- and media-related calls, dynamically checking actor method availability and handling mutations with toasts.",
  "frontend/src/index.css": "Tailwind base, theme colors, typography, layout constraints, and custom utility classes for consistent app styling.",
  "frontend/src/main.tsx": "Initializes React root, sets up React Query and Internet Identity providers, and renders the main App component.",
  "frontend/src/pages/AdminAdsPage.tsx": "Provides UI and logic for creating, updating, toggling, and deleting advertisements with form handling and CTR calculation.",
  "frontend/src/pages/AdminAffiliatePage.tsx": "Displays affiliate tiers and includes a dialog to create new tiers with validation and mutation hooks.",
  "frontend/src/pages/AdminApprovalPage.tsx": "Aggregates multiple pending approval queues with actions to approve or reject various content and user submissions.",
  "frontend/src/pages/AdminContentPage.tsx": "Allows admins to upload, list, and delete content with upload progress tracking and metadata form inputs.",
  "frontend/src/pages/AdminDisplayPage.tsx": "Provides UI for viewing current display content and submitting new screen content via a form.",
  "frontend/src/pages/AdminEditingRoomPage.tsx": "Offers admin tools to search, approve, reject, and delete various pending content types.",
  "frontend/src/pages/AdminHiiYahChatPage.tsx": "Manages pending broadcast and hero join requests with approve/reject actions and tabbed navigation.",
  "frontend/src/pages/AdminImageLibraryPage.tsx": "Handles image uploads with progress tracking and allows admins to approve, reject, download, or purge images.",
  "frontend/src/pages/AdminInviteAcceptPage.tsx": "Validates and redeems admin invite tokens, handling login requirements and redirecting after success.",
  "frontend/src/pages/AdminInviteLinksPage.tsx": "Page for admins to view, generate, and copy invite codes using React Query and actor API calls.",
  "frontend/src/pages/AdminMallPage.tsx": "Local CRUD interface for managing mall items with dialogs for create, edit, and delete actions.",
  "frontend/src/pages/AdminMediaUploadRoomPage.tsx": "Admin-only interface for uploading and managing media content with progress tracking and content filtering.",
  "frontend/src/pages/AdminMemberDirectoryPage.tsx": "Displays all user profiles with search and role filtering, fetched via actor API.",
  "frontend/src/pages/AdminPriceControlRoomPage.tsx": "Admin interface for adjusting subscription, content, and mall pricing with simulated save operations.",
  "frontend/src/pages/AdminPricingTermsPage.tsx": "Admin page for editing subscription pricing and managing terms and conditions, including loading, creating, and updating active terms. Includes tabbed UI for terms and pricing sections with admin-only access control.",
  "frontend/src/pages/AdminWalletManagementPage.tsx": "Admin dashboard for viewing and managing wallet recovery seeds and monitoring mock BTC balance data. Supports seed visibility toggling, clipboard copying, searching, and displays blockchain-related analytics.",
  "frontend/src/pages/AffiliateDashboardPage.tsx": "Affiliate dashboard for generating, viewing, and copying referral links and viewing tier-based referral statistics. Integrates backend hooks for link creation and performance data.",
  "frontend/src/pages/CategoryPage.tsx": "Displays media content filtered by category and allows selecting an item to open a player. Fetches category content and shows loading, empty, or grid views depending on state.",
  "frontend/src/pages/CreditCardPage.tsx": "User page for accessing a mock Excalibur credit card with placeholder balance loading functionality. Requires login and displays a stylized card preview with user-entered amount handling.",
  "frontend/src/pages/ExcaliburStudiosPage.tsx": "Creative workspace page featuring tabs for overview, Jitsi Meet integration, WAN 2.2 AI tools, and project management. Includes a hero section with studio branding and interactive project selection.",
  "frontend/src/pages/FlixiodTestPage.tsx": "Page embedding Flixiod streaming in an iframe with navigation, alerts, and a test player section.",
  "frontend/src/pages/HiiYahChatPage.tsx": "Chat hub integrating Rocket.Chat with connection codes, chat rooms, calls, and authentication gating.",
  "frontend/src/pages/HomePage.tsx": "Landing page showing featured content categories, intro text, and financial services with navigation.",
  "frontend/src/pages/IHeartRadioTestPage.tsx": "Page embedding iHeartRadio streaming in an iframe with alerts and external link support.",
  "frontend/src/pages/MallPage.tsx": "Displays Clear Magic Mall branding, search input, and a coming-soon message for shopping features.",
  "frontend/src/pages/SignUpPage.tsx": "User registration form with validation, async submission, and success confirmation flow.",
  "frontend/src/pages/StreamingPartnersPage.tsx": "Displays a grid of streaming platforms with icons, descriptions, and buttons to test or open each service.",
  "frontend/src/pages/TermsPage.tsx": "Fetches and displays active Terms and Conditions with loading skeletons and a back button.",
  "frontend/src/pages/WalletPage.tsx": "Manages wallet creation, seed handling, address display, and transaction viewing for authenticated users.",
  "frontend/src/types/backend-extended.ts": "Defines extended TypeScript interfaces representing media, transactions, wallet data, and other backend-related structures.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, animations, and plugin usage for the frontend UI.",
  "project_state.json": "Tracks project state for restoring the admin menu from v44 and ensuring full admin moderation actions, including features, issues, and pending requests."
}