{
  "backend/main.mo": "Defines actor with extensive domain types for media, users, ads, wallets, approvals, affiliates, and storage mixins but contains no business logic.",
  "feature_evidence.json": "Feature evidence report linking feature requests to affected frontend files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing frontend file purposes, routing, UI components, styles, and background image usage.",
  "frontend/index.css": "Tailwind base styles defining light/dark theme CSS variables and global background/foreground utilities.",
  "frontend/index.html": "HTML entry point defining root container, metadata, and loading the main React script.",
  "frontend/src/App.tsx": "Main router configuration wiring all public and admin pages, wrapping every /admin/* route with AdminRouteGuard.",
  "frontend/src/components/AdBanner.tsx": "Displays a single active banner ad, auto-tracking views and clicks, and opening target URLs.",
  "frontend/src/components/AdminAccessDenied.tsx": "UI card shown when a non-admin user attempts to access admin pages, offering navigation back to home.",
  "frontend/src/components/AdminRouteGuard.tsx": "Wraps children with admin-auth logic, showing a loading state or access denied based on identity and admin status.",
  "frontend/src/components/AdSidebar.tsx": "Displays up to three active sidebar ads and tracks impressions and clicks for each one.",
  "frontend/src/components/CategorySection.tsx": "Renders a grid of category cards that navigate to a category-specific page when clicked.",
  "frontend/src/components/ChatRoomComponent.tsx": "Implements a chat UI with polling, message sending, file uploads, and auto-scrolling.",
  "frontend/src/components/ContentCard.tsx": "Displays a media item with title, stats, type badge, and hover-to-play overlay.",
  "frontend/src/components/ContentGrid.tsx": "Shows tabbed lists of all and popular content and opens a player when an item is selected.",
  "frontend/src/components/ContentPlayer.tsx": "Modal player for video, audio, or image content with controls, rating, and metadata.",
  "frontend/src/components/DisplayScreen.tsx": "Shows the currently active display content with video playback and content metadata.",
  "frontend/src/components/Footer.tsx": "Footer with navigation links, social icons, branding, and optional admin login button.",
  "frontend/src/components/Header.tsx": "Provides the main site header with navigation, search, authentication controls, and an admin menu using routing and identity hooks.",
  "frontend/src/components/Hero.tsx": "Renders the homepage hero section with animated visuals and buttons linking to streaming and wallet sections.",
  "frontend/src/components/HeroHelper.tsx": "Implements an interactive assistant with chat, voice recognition, speech synthesis, and persistent user memory.",
  "frontend/src/components/JitsiMeetIntegration.tsx": "Integrates Jitsi Meet for live video conferencing with room setup, participant tracking, and UI controls.",
  "frontend/src/components/Layout.tsx": "Defines the global page layout with dynamic backgrounds, header, footer, routed content, and the HeroHelper widget.",
  "frontend/src/components/ProfileSetup.tsx": "Displays a simple modal for entering a user name and simulating profile creation.",
  "frontend/src/components/SharedPlaybackComponent.tsx": "Shows a shared playback feature placeholder with controls for starting playback and creating a room.",
  "frontend/src/components/VideoCallComponent.tsx": "UI component for a mock video call interface with mute, video toggle, and end-call actions.",
  "frontend/src/components/WAN22Integration.tsx": "Interface for creating AI-generated media projects, simulating WAN 2.2 API calls and managing project state.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance tied to Internet Identity, with automatic query invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, logout, and persistent identity loading.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for admin checks and media-related CRUD operations using the backend actor.",
  "frontend/src/index.css": "Global Tailwind CSS configuration defining theme colors, typography, layout constraints, and utility classes.",
  "frontend/src/main.tsx": "App entry point initializing React, QueryClient, InternetIdentityProvider, and global styles.",
  "frontend/src/pages/AdminAdsPage.tsx": "Provides a UI for creating, listing, toggling, and deleting advertisements with form handling and CTR calculation.",
  "frontend/src/pages/AdminAffiliatePage.tsx": "Displays and manages affiliate tiers, including creating new tiers through a dialog form.",
  "frontend/src/pages/AdminApprovalPage.tsx": "Aggregates and displays multiple types of pending administrative approvals with actions to approve or reject each.",
  "frontend/src/pages/AdminContentPage.tsx": "Allows uploading, listing, and deleting multimedia content with progress tracking and category selection.",
  "frontend/src/pages/AdminDisplayPage.tsx": "Manages theater display content, showing the currently active item and enabling upload of new display content.",
  "frontend/src/pages/AdminEditingRoomPage.tsx": "Displays pending content submissions with search, approve/reject, and delete actions using various admin mutation hooks.",
  "frontend/src/pages/AdminHiiYahChatPage.tsx": "Manages pending broadcast and Hero join requests with approve/reject controls in a tabbed admin interface.",
  "frontend/src/pages/AdminImageLibraryPage.tsx": "Handles image upload, approval, rejection, download, and library management with progress tracking and tabbed views.",
  "frontend/src/pages/AdminInviteAcceptPage.tsx": "Processes admin invite redemption, handling login flow, token validation, and success/error states.",
  "frontend/src/pages/AdminInviteLinksPage.tsx": "Generates, lists, and copies admin invite codes while distinguishing available and used codes.",
  "frontend/src/pages/AdminMallPage.tsx": "Admin UI for creating, editing, and deleting mall items with local state management and basic inventory stats.",
  "frontend/src/pages/AdminMediaUploadRoomPage.tsx": "Admin page for uploading media, tracking upload progress, and viewing categorized media content.",
  "frontend/src/pages/AdminMemberDirectoryPage.tsx": "Displays user directory with search and role filters, loading all profiles via actor query.",
  "frontend/src/pages/AdminPriceControlRoomPage.tsx": "Admin interface for updating subscription, content, and mall pricing with tabbed categories and save actions.",
  "frontend/src/pages/AdminPricingTermsPage.tsx": "Page for admins to edit pricing plans and manage terms and conditions, including loading and saving active terms.",
  "frontend/src/pages/AdminWalletManagementPage.tsx": "Admin dashboard displaying wallet recovery seeds with search, visibility toggling, copying, and mock BTC monitoring charts.",
  "frontend/src/pages/AffiliateDashboardPage.tsx": "Affiliate dashboard for generating, copying, and viewing referral links along with tier-based statistics.",
  "frontend/src/pages/CategoryPage.tsx": "Category view that fetches and displays media content by category with selectable playback modal.",
  "frontend/src/pages/CreditCardPage.tsx": "UI for viewing a mock Excalibur credit card and entering amounts, with basic validation and identity gating.",
  "frontend/src/pages/ExcaliburStudiosPage.tsx": "Workspace hub featuring tabs for overview, Jitsi integration, WAN 2.2 tools, and project management.",
  "frontend/src/pages/FlixiodTestPage.tsx": "Test page embedding Flixiod streaming for previewing movie/TV playback and opening the service externally.",
  "frontend/src/pages/HiiYahChatPage.tsx": "Chat page with authentication check, placeholder connection features, and UI for chat rooms, calls, and shared playback.",
  "frontend/src/pages/HomePage.tsx": "Home landing page displaying featured sections, introduction text, and financial services showcase.",
  "frontend/src/pages/IHeartRadioTestPage.tsx": "Test page embedding iHeartRadio player with navigation, alerts, and external link options.",
  "frontend/src/pages/MallPage.tsx": "Mall page with search input and a placeholder card indicating the shopping feature is coming soon.",
  "frontend/src/pages/SignUpPage.tsx": "User registration form handling validation, submission, and post-submission confirmation.",
  "frontend/src/pages/StreamingPartnersPage.tsx": "Lists streaming partners with navigation to test integrations and links to external platforms.",
  "frontend/src/pages/TermsPage.tsx": "Renders the Terms and Conditions page, fetching active terms and displaying either the content, a loading state, or a fallback message. Includes navigation back to home and formatted version/date info.",
  "frontend/src/pages/WalletPage.tsx": "Implements the wallet dashboard with identity‑based wallet address setup, wallet creation/migration, balance and transaction display, and utility functions like copying, formatting, and transaction labeling.",
  "frontend/src/types/backend-extended.ts": "Defines extended frontend TypeScript interfaces mirroring expected backend data structures, including media, transactions, user requests, ads, wallet info, and terms types.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading URL parameters, persisting them in sessionStorage, and cleaning parameters from hash-based routes. Supports maintaining state like admin tokens across navigation.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, animations, shadows, and container settings, enabling theme extensions and plugin integration for typography, container queries, and animations.",
  "project_state.json": "Stores project state metadata including known issues, required image assets, and a list of feature requirements tied to app authorization, navigation, layout fixes, and build reliability."
}