{
  "kind": "build_request",
  "title": "Complete and fix the Admin area (navigation, access flow, and all required admin rooms)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Restore a complete, working Admin navigation experience so authenticated admins can reliably access every required admin room from (1) the Header Admin dropdown and (2) the Admin Rooms hub page at /admin/rooms.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "You still did not accomplish the requested job. Get the admin area done as requested."
        ]
      },
      "acceptanceCriteria": [
        "When logged in as an admin, the Header shows an Admin dropdown that contains links to every required admin room, and each link navigates successfully.",
        "/admin/rooms is accessible to admins and shows a hub UI with links to every required admin room (excluding self-link).",
        "All admin navigation links match the actual registered router paths (no 404s, no broken links).",
        "Admin navigation is usable on both desktop and mobile (no overflow, items are scrollable when long)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the admin access flow is correct and consistent: all admin routes are protected, admins can access them, and non-admin users (or logged-out users) are blocked using the existing AdminAccessDenied screen without crashes or infinite loading states.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Get the admin area done as requested."
        ]
      },
      "acceptanceCriteria": [
        "Every /admin/* route is guarded so that non-authenticated or non-admin users cannot view admin pages.",
        "Non-admin and logged-out users attempting to access /admin/* routes see the existing access denied UI (not a blank screen).",
        "Admins do not see access denied for valid admin routes; guard verification completes successfully.",
        "Admin status checks are resilient to identity changes (login/logout) and do not require a hard refresh to start working."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Rebuild and/or verify that all required admin rooms and panels are present, routable, and do not crash; ensure each page renders with safe loading/empty/error states and that primary actions work end-to-end with the backend where supported. Required rooms: approvals dashboards, editing room, uploads, pricing/terms, price control, image library, wallet management, ads, affiliate, member directory, invite links, display screen, and mall admin.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "You still did not accomplish the requested job."
        ]
      },
      "acceptanceCriteria": [
        "Each required admin room has a working route and renders without runtime errors in the browser console.",
        "Each room has safe loading/empty/error UI so missing data or backend errors do not crash the page.",
        "Admin Ads supports create/update/delete/toggle active without UI dead-ends (buttons either work or show a clear, non-crashing error).",
        "Admin Affiliate supports creating and listing tiers (or shows a clear message if backend capability is missing).",
        "Admin Invite Links can generate/list codes and copy invite URLs; invite accept flow at /invite/accept works for valid/invalid tokens with clear messaging.",
        "Approvals and Editing Room pages allow approve/reject flows (or show capability-based disabling with clear explanation) and never crash when queues are empty.",
        "Media Upload and Image Library allow upload flows (or degrade gracefully if storage/back-end methods are unavailable), and list items with correct grouping/status.",
        "Pricing & Terms and Price Control pages render and allow saving changes where supported; otherwise show a clear non-crashing placeholder stating the capability is unavailable.",
        "Member Directory loads and displays user profiles (or shows a clear message if the backend method is unavailable) and supports basic filtering/search UI without crashing.",
        "Display Screen admin page loads current state and allows setting/updating display content (or degrades gracefully with clear messaging).",
        "Mall Admin page renders and supports CRUD actions (or degrades gracefully with clear messaging)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Prevent regressions: keep all existing requested functionality working while finishing the admin system, and ensure no new runtime errors are introduced in unrelated areas (public pages, wallet, credit card, streaming partners, chat).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Get the admin area done as requested."
        ]
      },
      "acceptanceCriteria": [
        "No new console errors are introduced on core non-admin routes (/, /wallet, /credit-card, /streaming-partners, /hiiyah-chat, /mall, /terms).",
        "Existing navigation (public and authenticated user navigation) continues to work after admin fixes.",
        "Admin changes do not break Internet Identity login/logout flow and do not require a page refresh to recover from auth changes."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not edit files under frontend/src/components/ui (compose these components instead).",
    "Do not edit immutable hook/bootstrap files listed in SYSTEM_CONTEXT (frontend/src/hooks/useInternetIdentity.ts / .tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx).",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Adding new unrelated product features outside the admin restoration scope.",
    "Integrating third-party authentication providers (only Internet Identity is supported).",
    "Adding external databases or non-Motoko backend services.",
    "Real-time features via WebSockets/push notifications."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}