{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Ensure all requested admin rooms exist and add /admin/rooms landing page",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Audit requested admin rooms vs registered routes and admin nav; add missing admin rooms with working routes and visible Admin menu items, plus an in-code route mapping list.",
      "acceptanceCriteria": [
        "A documented list exists in code (or in the PR description) mapping each requested room name to its route.",
        "Every requested room has a corresponding route registered in `frontend/src/App.tsx` and an entry in `frontend/src/constants/adminNav.ts` (unless explicitly noted as intentionally excluded).",
        "Navigating to each requested room route renders a page (not a blank screen) and does not throw console errors."
      ],
      "file_operations": [
        {
          "path": "frontend/src/constants/adminNav.ts",
          "operation": "modify",
          "description": "Add/verify the complete set of requested admin rooms as `ADMIN_NAV_ITEMS` entries (Admin menu source of truth) and add an exported in-code mapping list (e.g., `REQUESTED_ADMIN_ROOMS_ROUTE_MAP` or similar) that maps each requested room label to its route. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Audit admin route registrations against the requested admin rooms list and add any missing admin routes, ensuring each admin page is wrapped in `AdminRouteGuard` and existing routes remain unchanged. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add an admin-guarded '/admin/rooms' landing page that lists all admin rooms from adminNav as responsive link cards and is accessible from the Admin menu.",
      "acceptanceCriteria": [
        "`/admin/rooms` exists, is wrapped by `AdminRouteGuard`, and is accessible from the Admin menu.",
        "The page lists all admin room links derived from `frontend/src/constants/adminNav.ts` (label + icon + route), and each link navigates correctly.",
        "Layout is responsive (mobile + desktop) with no overlapping text/images and no horizontal overflow."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminRoomsPage.tsx",
          "operation": "create",
          "description": "Create the Rooms landing page UI at `/admin/rooms` that renders a responsive grid/list of clickable cards sourced from `ADMIN_NAV_ITEMS` (or `getOrderedAdminNavSections()`), showing each item’s icon + label and navigating to its route; exclude the `/admin/rooms` item itself from the rendered list to avoid self-linking. Compose existing shadcn-ui primitives (e.g., Card/Button/ScrollArea) without editing `frontend/src/components/ui/*`. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/constants/adminNav.ts",
          "operation": "modify",
          "description": "Add an Admin menu item for the new Rooms landing page (label like 'Rooms', route `/admin/rooms`, icon, section, order) so it is visible in the Admin dropdown menu and usable as the entrypoint to all rooms. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register the `/admin/rooms` route in the router and wrap it with `AdminRouteGuard`, wiring it to `AdminRoomsPage` so navigating to `/admin/rooms` renders the landing page. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}