{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Restore functional admin flow: enable admin detection, show full admin menu/rooms, and remove visible version label",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Remove all visible app version UI so no page renders a version label/badge (including removing VersionBadge from Admin Rooms).",
      "acceptanceCriteria": [
        "Navigating to /admin/rooms does not show `VersionBadge` and no version text appears in the header/content/footer of that page.",
        "No page in the app renders a visible version label or badge (e.g., \"version 42\"), including after login and on both desktop and mobile breakpoints.",
        "Removing the version label does not break layout or navigation."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminRoomsPage.tsx",
          "operation": "modify",
          "description": "Remove the `VersionBadge` import and render from the Admin Rooms page header so no version string is visible on /admin/rooms."
        },
        {
          "path": "frontend/src/components/VersionBadge.tsx",
          "operation": "modify",
          "description": "Change `VersionBadge` to render nothing (or otherwise be non-visible) to ensure no accidental usage anywhere in the UI can display a version label. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/constants/appVersion.ts",
          "operation": "modify",
          "description": "Remove or neutralize the exported `APP_VERSION` label (and any intended UI usage expectations) so it cannot be displayed to end-users."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Ensure authenticated admins reliably see the full Admin navigation (desktop and mobile) sourced from `getAdminNavSections()` / `ADMIN_NAV_ITEMS`, while non-admins never see it and remain blocked by `AdminRouteGuard`.",
      "acceptanceCriteria": [
        "When logged in as an admin, the Header renders an Admin entry (desktop) and the admin navigation is accessible on mobile as well.",
        "Admin navigation items are derived from `getAdminNavSections()` / `ADMIN_NAV_ITEMS` and are not missing/hidden for admins.",
        "Clicking any Admin navigation item navigates to its route and renders the corresponding admin page (or an admin-guarded denial only when not an admin).",
        "When logged in as a non-admin (or logged out), the Admin navigation is not shown and admin routes render the access denied UI via `AdminRouteGuard`."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Restore/ensure Admin navigation appears for admins on desktop and is equivalently accessible on mobile by rendering all sections/items from `getAdminNavSections()` (derived from `ADMIN_NAV_ITEMS`), and hiding the admin nav entirely for non-admins/logged-out users."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Harden `useIsCallerAdmin()` behavior for identity changes to avoid stale results (e.g., ensure cache keys/refetch behavior stays principal-specific and returns a boolean without leaking errors into UI)."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Make /admin/rooms a working admin hub that lists navigable rooms sourced from `ADMIN_NAV_ITEMS` and routes to existing AdminRouteGuard-protected admin pages, without any version label displayed.",
      "acceptanceCriteria": [
        "/admin/rooms renders a grid/list of admin rooms sourced from `ADMIN_NAV_ITEMS` (excluding self-link to /admin/rooms).",
        "The list includes (at minimum) links/cards for: Content Approval & Editing (`/admin/editing-room`), Approvals (`/admin/approvals`), Media Upload (`/admin/media-upload`), Image Library (`/admin/image-library`), and Uploads & Downloads (`/admin/content`).",
        "Each room card and its “Open Room” control correctly navigates to the specified route.",
        "No version label/badge is displayed anywhere on the Admin Rooms page."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminRoomsPage.tsx",
          "operation": "modify",
          "description": "Ensure the Rooms hub renders its grid exclusively from `ADMIN_NAV_ITEMS` (excluding /admin/rooms), and that both the card click and the “Open Room” control navigate to the correct admin route."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Verify all required admin room routes referenced by `ADMIN_NAV_ITEMS` exist in the router and remain wrapped in `AdminRouteGuard` so each room link resolves to a guarded admin page."
        }
      ]
    }
  ]
}